/********************************************************************************
**
** 文件名:     	 encrypt.h 
** 版权所有:   (c) 	 2016 厦门立林科技有限公司
** 文件描述:   
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期        | 作者     |  修改记录
**===============================================================================
**| 2016/04/22  | Kimson  |  创建该文件
**
*********************************************************************************/
#ifndef _ENCRYPT_H_     
#define _ENCRYPT_H_    
 
 
/*------------------------------- Includes ----------------------------------*/
 
 
/*----------------------------- Global Defines ------------------------------*/
 
 
/*----------------------------- Global Typedefs -----------------------------*/
 
 
/*----------------------------- External Variables --------------------------*/
 
 
/*------------------------ Global Function Prototypes -----------------------*/
/*******************************************************************
** 函数名:      gen_key_ic 
** 函数描述:    根据输入信息，生成IC卡密钥
** 参数:       	输入: 
                     type - 0: KeyA, 1:KeyB
                     id_4b - 4Bytes 卡号
                     sec_1b - 1Bytes 扇区编号
                     project_16b - 16Bytes 项目名
               输出:
                     key_6b - 6Bytes 密钥
** 返回:       	 
** 注意: 	 
** 记录: 	 2016/04/22,  Kimson创建
********************************************************************/
void  gen_key_ic(const unsigned char type, const unsigned char *id_4b, const unsigned char sec_1b, const unsigned char *project_16b, unsigned char *key_6b);
/*******************************************************************
** 函数名:      gen_key_cpu 
** 函数描述:    生成CPU卡密钥
** 参数:       	输入: 
                     id_4b - 4Bytes 卡号
                     adf_2b - 2Bytes ADF编号
                     keyid_1b - 1Byte 目标KEY ID号
                     project_16b - 16Bytes 项目名
               输出:
                     key_16b - 16Bytes 密钥
                
** 返回:       	 
** 注意: 	 
** 记录: 	 2016/04/22,  Kimson创建
********************************************************************/
void gen_key_cpu(const unsigned char *id_4b, const unsigned char *adf_2b, const unsigned char keyid_1b, const unsigned char *project_16b, unsigned char *key_16b); 
 

#endif //_ENCRYPT_H_
