/******************************************************************************

                  版权所有 (C), 2015-2025, 立林科技有限公司

 ******************************************************************************
  文 件 名   : uart_drv.h
  版 本 号   : 初稿
  作    者   : wzh
  生成日期   : 2016年6月21日
  最近修改   :
  功能描述   : 
  函数列表   :
  修改历史   :
  1.日    期   : 2016年6月21日
    作    者   : wzh
    修改内容   : 创建文件

******************************************************************************/
#ifndef _UART_DRV_H_
#define _UART_DRV_H_
/*-------------------------------- Includes ----------------------------------*/
 #include "stm32f0xx.h"
 
/*----------------------- Constant / Macro Definitions -----------------------*/
typedef enum
{
    COM1 = 0,
    COM2,
    COMn,
}COM_TypeDef;

/*------------------------ Variable Define/Declarations ----------------------*/
 
 
/*----------------------------- External Variables ---------------------------*/
 

/*------------------------ Function Prototype --------------------------------*/
 
 
/*------------------------ Variable Define/Declarations ----------------------*/
 
 
/*------------------------ Function Implement --------------------------------*/
 
 
/*---------------------------------------------------------------------------*/
void STM_EVAL_COMInit(COM_TypeDef COM, USART_InitTypeDef* USART_InitStruct);
void uart_drv_init(COM_TypeDef com_num);
#endif
