/******************************************************************************

                  版权所有 (C), 2015-2025, 立林科技有限公司

 ******************************************************************************
  文 件 名   : com_func_config.h
  版 本 号   : 初稿
  作    者   : wzh
  生成日期   : 2016年6月15日
  最近修改   :
  功能描述   : 
  函数列表   :
  修改历史   :
  1.日    期   : 2016年6月15日
    作    者   : wzh
    修改内容   : 创建文件

******************************************************************************/
#ifndef _COM_FUNC_CONFIG_H_
#define _COM_FUNC_CONFIG_H_
/*-------------------------------- Includes ----------------------------------*/
 #include <stdint.h>
 
/*----------------------- Constant / Macro Definitions -----------------------*/


/*------------------------ Variable Define/Declarations ----------------------*/
 
 
/*----------------------------- External Variables ---------------------------*/
 

/*------------------------ Function Prototype --------------------------------*/
 
 
/*------------------------ Variable Define/Declarations ----------------------*/
 
 
/*------------------------ Function Implement --------------------------------*/
 
 
/*---------------------------------------------------------------------------*/
void rs485_id1_init(void);
void rs485_id1_start_send(void);
void rs485_id1_stop_send(void);
void rs485_id1_send(uint8_t value);


void uart2_init(void);
void uart2_start_send(void);
void uart2_stop_send(void);
void uart2_send(uint8_t value);


#endif

