/******************************************************************************

                  版权所有 (C), 2015-2025, 立林科技有限公司

 ******************************************************************************
  文 件 名   : param_mode.h
  版 本 号   : 初稿
  作    者   : wzh
  生成日期   : 2016年2月25日
  最近修改   :
  功能描述   : 
  函数列表   :
  修改历史   :
  1.日    期   : 2016年2月25日
    作    者   : wzh
    修改内容   : 创建文件

******************************************************************************/
#ifndef _PARAM_MODE_H_
#define  _PARAM_MODE_H_
/*-------------------------------- Includes ----------------------------------*/
 
 
/*----------------------- Constant / Macro Definitions -----------------------*/
typedef enum
{
    UNLOCK_TIME_PARAM,
    ANTI_COPY_PARAM,
    OPEN_TIMEOUT_PARAM,
}sys_param_type;



/*------------------------ Variable Define/Declarations ----------------------*/
 
 
/*----------------------------- External Variables ---------------------------*/
 

/*------------------------ Function Prototype --------------------------------*/
 
 
/*------------------------ Variable Define/Declarations ----------------------*/
 
 
/*------------------------ Function Implement --------------------------------*/
 
 
/*---------------------------------------------------------------------------*/
void param_mode_init(void);
void set_sys_param(sys_param_type type, uint16_t param);
uint8_t get_sys_param(sys_param_type type);
uint8_t *get_anti_copy_param(void);
#endif

